'use strict';

// let num = 20;

// function showFirstMessage(text) {
//     alert(text);
//     // num = 10;
//     // таким образом переменная становится глобальной;
//     // let num = 10;
//     // это уже другая переменная;
//     console.log(num);
// };
// // объявление функции, имя функции, в скобках параметры (данные), то что будет выполнятся;
// showFirstMessage("hello world!");
// // вызов функции;
// // сообщение выводится в модальное окно с переданным аргументом;
// console.log(num);
// // если объявить перемунную внутри функции снаружи она не будет видна она локальная;
// // при вызове переменной внутри функции она сначала ищет внутри а затем делает это глобально;

function calc(a, b) {
    return (a + b);
}
// a, b параметры;
// return возвращает значения в параметры;
console.log(calc(5, 5));
console.log(calc(10,4));

function retVar() {
    let num = 50;
    return num;
}
// возвращение переменной во внешний мир;

let anotherNum = retVar();
console.log(anotherNum);