'use strict'

console.log(leftBorderWidth);
// undefined озночает что переменная создана, но пока не имеет какого-то значения;
var leftBorderWidth = 1;
// если var объявлена в коде, то она уже существует до выполнения скрипта, она видна везде;
let second = 2;
// let создается только тогда, когда код до нее доходит это называется хостинг или всплытие переменных;
// let видна только в блоке кода ограниченным фигурными скобками;
const pi = 3.14;
// создает константу которую нельзя поменять;

console.log(leftBorderWidth);
console.log(second);

