'use strict';

// сложение, вычитание, умножение, деление;
// string + число = string;
// string + string = string;
// это называется конкотинация;

// console.log("arr" + " - object");
// console.log(4 + + " - object");
// // эти значения будут string;
// // если поставить + то значение преобразуется в строку и получится NaN, потому что число и строка дает NaN;

// let answer = +prompt("Есть ли вам 21? ");
// console.log(typeof(answer));
// // если поставить перед значением унарный + то тип данных сменится на числовое значение;

let incr = 10,
    decr = 10;


// console.log(++incr);
// console.log(--decr);

console.log(incr++);
console.log(decr--);
console.log(incr);
// данная команда сначала возваращает старое значение и только потом изменяет;
// префиксная форма возвращает уже измененное;
// постфиксная старое;

console.log(8%5);
// данный оператор возвращает остаток от деления;

// = присваивание; == это проверка на равенство; === строгая проверка оп типам данных;

console.log("2" == 2);
// в данном случет == сравнивает по значениям и будет true, несмотря на то что это разные типы данных;
console.log("2" === 2);
// в данном случае идет сравнение по типам данных и будет false;

let isChecked = true,
    isClose = true;

console.log(isChecked && isClose);
// оператор && возвращает true если все аргументы true;
console.log(isChecked || isClose);
// опертор || возвращет true если хотя бы один аргумент является true;
// ! оператор отрицания обращает значение в обратное;

