'use strict';

// if(2 * 4 == 8) {
//     console.log("Верно!")
// } else {
//     console.log("Неверно!")
// };
// // if преобразует значение в логический или boolean значение;

let num = 50;

if (num < 49) {
    console.log("Неверно")
} else if (num > 100) {
    console.log("Слишком много")
} else {
    console.log("Это так")
};

(num == 50) ? console.log("Верно") : console.log("Неверно!");
// num == 50 это условие, после ? то действие которое выполнится в случае успеха, после : то действие которые выполнится если условие не верно;
// тернарный оператор т.к используется три аргумента;

switch (num) {
    case num < 49:
        console.log("Неверно!");
        break;
    case num > 100:
        console.log("Слишком много");
        break;
    case num > 80:
        console.log("Все еще много!");
        break;
    case 50:
        console.log("Верно!");
        break;
    default:
        console.log("Что то пошло не так");
        break;
}
// case это сравнение, если условие выполняется выполняется команда внутри него, до того как оно встретит break;
// в случае невыполнения всех условий выполнится default;
// в случае с равенством/сравнением не нужно указывать == или имя переменной;